lvx/base/Enums/бит_мпд_ВидыРасположенияИнформационныхБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_мпд_ВидыРасположенияИнформационныхБаз</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Файловая</Name>
					<Comment>Файловая база COM- соединение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Серверная</Name>
					<Comment>Серверная база COM - соединение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RestСервис</Name>
					<Comment>Подключение к автоматическому REST-сервису</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/Catalogs/бит_ИсточникиДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ИсточникиДанных</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.бит_Запросы</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипИсточника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыИсточниковДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросБД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Запросы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиПостроителя</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСлагаемогоРасшифровкиРеглОтчетности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Релиз</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАлгоритмаЭлиминации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_ТипыАлгоритмовЭлиминации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_НастройкиВнешнихПодключений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИнформационнойБазы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_ВидыИнформационныхБаз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоотвСтатьиРегл_Применить</Name>
					<Comment>Применить</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоотвСтатьиРегл_ПоляИсточники</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоотвСтатьиРегл_ПолеПриемник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоотвПодразделения_Применить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоотвПодразделения_ПоляИсточники</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоотвПодразделения_ПолеПриемник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоотвНомГруппы_Применить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоотвНомГруппы_ПоляИсточники</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоотвНомГруппы_ПолеПриемник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПослеПолученияДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтборВОтчете</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначения</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначенияСтр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Измерения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Порядок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеСортировки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_НаправленияСортировки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиСоответствий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСоответствия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ВидыСоответствийАналитик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоляИсточники</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоляПриемники</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/CommonForms/бит_мпд_ФормаВыбораСвойствПостроителя/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Режим"                    , Режим);
	Параметры.Свойство("АдресИсточникаПостроителя", АдресИсточникаПостроителя);
	Параметры.Свойство("ВидИнформационнойБазы"    , ВидИнформационнойБазы);
	Параметры.Свойство("ВыводитьВложенные"        , ВыводитьВложенные);
	Параметры.Свойство("ТекПутьКДанным"           , ТекПутьКДанным);
	Параметры.Свойство("ТекстЗапроса"             , ТекстЗапроса);
	Параметры.Свойство("НастройкаПодключения"     , НастройкаПодключения);
	Параметры.Свойство("ЗапросБД"                 , ЗапросБД);
	Параметры.Свойство("Поля"                     , ВыбранныеПоляИсточника);
	
	Если Параметры.Свойство("ИсточникДанных") Тогда
		ТекИсточник = Параметры.ИсточникДанных;
		ЗапросБД = ТекИсточник.ЗапросБД;
		ВыбранныеПоляИсточника = Новый Структура;
		Для каждого СтрокаТаблицы Из ТекИсточник.Поля Цикл
			Если СтрокаТаблицы.Использование Тогда
				ОписаниеПоля = Новый Структура("Имя, Синоним, ВидПоля", СтрокаТаблицы.Имя, СтрокаТаблицы.Синоним, СтрокаТаблицы.ВидПоля);
				ВыбранныеПоляИсточника.Вставить(СтрокаТаблицы.Имя, ОписаниеПоля);
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
	Если Параметры.Свойство("МассивСубконто") Тогда	
		СписокСубконто.ЗагрузитьЗначения(Параметры.МассивСубконто); 	
	КонецЕсли;
	Параметры.Свойство("ДтКт", ДтКт);
		
	Если ЭтоАдресВременногоХранилища(АдресИсточникаПостроителя) Тогда
		ИсточникПостроителя = ПолучитьИзВременногоХранилища(АдресИсточникаПостроителя);
		АдресИсточникаПостроителя = ПоместитьВоВременноеХранилище(ИсточникПостроителя, УникальныйИдентификатор);
	КонецЕсли; 
	
	ЭтоВнешняяБаза = бит_ПолучениеДанныхВнешниеИсточникиСервер.ЭтоВнешняяБаза(ВидИнформационнойБазы);
	
	// В случае вызова из обычной формы значения во временном хранилище не передаются...
	// единственный способ инициализировать построитель прямо в форме.
	Построитель = ИнициализироватьПостроитель();
	
	Если ПостроительГодный(Построитель) Тогда
		ЭлементыДерева = ДеревоПолей.ПолучитьЭлементы();
		
		// Заполним дерево
		ЗаполнитьДеревоПолей(Построитель.ДоступныеПоля, ЭлементыДерева);
		Если НЕ ПустаяСтрока(ТекПутьКДанным) Тогда
			
			// Установим текущую строку дерева
			флИгнорироватьРазворачивание = Истина;
			МассивИмен = бит_СтрокиКлиентСервер.РазобратьСтрокуСРазделителями(ТекПутьКДанным,".");
			
			ТекКоллекция = ЭлементыДерева;
			Для каждого Имя Из МассивИмен Цикл
				ТекСтрока = НайтиСтрокуДереваПоИмени(ТекКоллекция,Имя);
				Если НЕ ТекСтрока = Неопределено Тогда
					 ДобавитьВложенныеПоля(ТекСтрока.ПолучитьИдентификатор());
					 ТекКоллекция = ТекСтрока.ПолучитьЭлементы();
				КонецЕсли; 
			КонецЦикла; 
			
			Если НЕ ТекСтрока = Неопределено Тогда
				Элементы.ДеревоПолей.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
			КонецЕсли; 
		КонецЕсли; // НЕ ПустаяСтрока(ТекущийПутьКДанным)
	КонецЕсли;
	
	ЗакрыватьПриВыборе = Ложь;	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоПолей

&НаКлиенте
Процедура ДеревоПолейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = ДеревоПолей.НайтиПоИдентификатору(ВыбраннаяСтрока);	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		РезСтруктура = СформироватьСтруктуруРезультат(ТекущаяСтрока);
		ОповеститьОВыборе(ТекущаяСтрока.Представление);
		Закрыть(РезСтруктура);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПолейПриАктивизацииСтроки(Элемент)
	
	Если флИгнорироватьРазворачивание Тогда	
		флИгнорироватьРазворачивание = Ложь;	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПолейПередРазворачиванием(Элемент, Строка, Отказ)
	
	Если НЕ флИгнорироватьРазворачивание Тогда	
    	ДобавитьВложенныеПоля(Строка);	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ТекущаяСтрока = Элементы.ДеревоПолей.ТекущиеДанные;	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		РезСтруктура = СформироватьСтруктуруРезультат(ТекущаяСтрока);
		ОповеститьОВыборе(ТекущаяСтрока.Представление);
		Закрыть(РезСтруктура);
		
	Иначе	
		
		Закрыть();
		
	КонецЕсли; 
	           	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// ДеревоПолейСиноним, ДеревоПолейИмя.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоПолейСиноним");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоПолейИмя");

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	"ДеревоПолей.ПутьКДанным", ВидСравненияКомпоновкиДанных.Содержит, "Субконто");

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ЦветГиперссылки);
	
КонецПроцедуры
  
// Функция формирует структуру результат.
// 
// Возвращаемое значение:
//  РезСтруктура - Структура
// 
&НаКлиенте
Функция СформироватьСтруктуруРезультат(ТекущаяСтрока)
	
	РезСтруктура = Новый Структура;
	РезСтруктура.Вставить("ПутьКДанным"    , ТекущаяСтрока.ПутьКДанным);
	РезСтруктура.Вставить("Синоним"        , ТекущаяСтрока.Синоним);
	РезСтруктура.Вставить("Представление"  , ТекущаяСтрока.Представление);
	РезСтруктура.Вставить("ТипЗначения"    , ТекущаяСтрока.ТипЗначения);
	РезСтруктура.Вставить("Имя"            , ТекущаяСтрока.Имя);
	РезСтруктура.Вставить("ЭтоЧисловоеПоле", ТекущаяСтрока.ЭтоЧисловоеПоле);
	
	Возврат РезСтруктура;
	
КонецФункции // СформироватьСтруктуруРезультат()

// Функция выполняет поиск строки в коллекции строк дерева.
// 
// Параметры:
//   КоллецияСтрок - ДанныеФормыКоллекцияЭлементовДерева.
// 
// Возвращаемое значение:
//  СтрокаДерева - ДанныеФормыЭлементДерева.
// 
&НаСервере
Функция НайтиСтрокуДереваПоИмени(КоллекцияСтрок, Имя)

	СтрокаДерева = Неопределено;
	
	Для каждого ТекСтрока Из КоллекцияСтрок Цикл
	
		Если ТекСтрока.Имя = Имя Тогда
		
			СтрокаДерева = ТекСтрока;
		
		КонецЕсли; 
	
	КонецЦикла; 

	Возврат СтрокаДерева;
	
КонецФункции // НайтиСтрокуДереваПоИмени()

// Функция определяет можно ли работать с построителем.
// 
// Параметры:
// Построитель - ПостроительОтчета, ПостроительЗапроса.
// 
// Возвращаемое значение:
//  флГодный - Булево.
// 
&НаСервере
Функция ПостроительГодный(Построитель)

	флГодный = Ложь;
	
	Если ТипЗнч(Построитель) = Тип("ПостроительОтчета") 
		 ИЛИ ТипЗнч(Построитель) = Тип("ПостроительЗапроса") 
		 ИЛИ ТипЗнч(Построитель) = Тип("ComObject") Тогда
	
		флГодный = Истина;
	
	КонецЕсли;	
	

	Возврат флГодный;
	
КонецФункции // ПостроительГодный()

&НаСервере
Функция ПолеПринадлежитТипуРодителя(Поле, СтрокаРодитель)
	
	Если СтрокаРодитель = Неопределено
		ИЛИ НЕ СтрокаРодитель.ЭтоВыборТипаПоля Тогда
		Возврат Истина;
	КонецЕсли;
	
	ТипыРодителя = СтрокаРодитель.ТипЗначения.Типы();
	Если ТипыРодителя.Количество() <> 1 Тогда
		Возврат Истина;
	КонецЕсли;
	
	МетаданныеТипа = Метаданные.НайтиПоТипу(ТипыРодителя[0]);
	Если МетаданныеТипа = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	ИмяПоля = Поле.Имя;
	
	Если МетаданныеТипа.Реквизиты.Найти(ИмяПоля) = Неопределено Тогда
		Для каждого СтандартныйРеквизит Из МетаданныеТипа.СтандартныеРеквизиты Цикл
			Если СтандартныйРеквизит.Имя = ИмяПоля Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Функция определяет соответствует ли поле режиму настройки.
// 
// Параметры:
//  ДоступноеПоле - ПолеНастройки.
// 
// Возвращаемое значение:
//  флСоответствует - Булево.
// 
&НаСервере
Функция ПолеСоответствуетРежиму(ДоступноеПоле)

	флСоответствует = Ложь;
	
	Если ВРег(Режим) = ВРег("Отбор") Тогда	
		флСоответствует = ДоступноеПоле.Отбор;
		
	ИначеЕсли ВРег(Режим) = ВРег("Измерение") Тогда		
		флСоответствует = ДоступноеПоле.Измерение;
		
	ИначеЕсли ВРег(Режим) = ВРег("Порядок") Тогда		
		флСоответствует = ДоступноеПоле.Порядок;
		
	ИначеЕсли ВРег(Режим) = ВРег("Поле") Тогда		
		флСоответствует = ДоступноеПоле.Поле;
	
	КонецЕсли; 

	Возврат флСоответствует;
	
КонецФункции

// Процедура заполняет дерево полей.
// 
// Параметры:
//  ДоступныеПоля  - ПоляНастройки.
//  ЭлементыВерх   - ДанныеФормыКоллекцияЭлементовДерева.
//  СтрокаРодитель - ДанныеФормыЭлементДерева.
// 
&НаСервере
Процедура ЗаполнитьДеревоПолей(ДоступныеПоля, ЭлементыВерх, СтрокаРодитель = Неопределено)
	
	ЭтоHTTP = НастройкаПодключения.РасположениеБазы = Перечисления.бит_мпд_ВидыРасположенияИнформационныхБаз.RestСервис;	
	Если ЭтоВнешняяБаза И НЕ ЭтоHTTP Тогда		
		 Соединение = ВыполнитьПодключение();		 
		 ПравилаПоискаВнешТек = РегистрыСведений.бит_мпд_НазначениеПравилПоискаДанных.ПолучитьПравилаПоиска(ВидИнформационнойБазы,
		 	Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза);	
	КонецЕсли; 
	
	Для каждого ДоступноеПоле Из ДоступныеПоля Цикл
		
		Если НЕ ПолеПринадлежитТипуРодителя(ДоступноеПоле, СтрокаРодитель) Тогда
			Продолжить;
		КонецЕсли;
	
		Если ПолеСоответствуетРежиму(ДоступноеПоле) Тогда
		
			ЭлементДерева = ЭлементыВерх.Добавить();
			ЭлементДерева.Имя         	  = ДоступноеПоле.Имя;
			ЭлементДерева.ПутьКДанным 	  = ДоступноеПоле.ПутьКДанным;			
			ЭлементДерева.Синоним     	  = ДоступноеПоле.Представление;
			ЭлементДерева.ЭтоЧисловоеПоле = Справочники.бит_ИсточникиДанных.ЭтоЧисловоеПоле(ДоступноеПоле,Соединение);
			ЭлементДерева.Представление   = ?(ДоступноеПоле.Родитель = Неопределено, ДоступноеПоле.Представление, 
				ДоступноеПоле.Родитель.Представление + "." + ДоступноеПоле.Представление);
			
			Если НЕ ЭтоВнешняяБаза ИЛИ ЭтоHTTP Тогда
				ЭлементДерева.ТипЗначения = ДоступноеПоле.ТипЗначения;
			Иначе				
				Если Соединение <> Неопределено Тогда				
					 ОписаниеТекущая = бит_ПолучениеДанныхВнешниеИсточникиСервер.ПреобразоватьОписаниеТиповВнешняяТекущая(Соединение,
					 	ДоступноеПоле.ТипЗначения, ПравилаПоискаВнешТек);
					 ЭлементДерева.ТипЗначения = ОписаниеТекущая;				
				КонецЕсли;				
			КонецЕсли; 
			
			// Для периодичности установим тип значения вручную.
			Если ЭлементДерева.Имя = "Периодичность" И ЭлементДерева.ТипЗначения.Типы().Количество() = 0 Тогда			
				 ЭлементДерева.ТипЗначения = Новый ОписаниеТипов("Число", 
				 	Новый КвалификаторыЧисла(2, 0, ДопустимыйЗнак.Неотрицательный));			
			КонецЕсли; 
			
			// В некоторых случаях у полей настройки
			Попытка
				флЕстьВложенные = ДоступноеПоле.Поля.Количество()>0;
			Исключение
				флЕстьВложенные = Ложь;
				Для каждого ТекПоле Из ДоступноеПоле.Поля Цикл
					флЕстьВложенные = Истина;
					Прервать;
				КонецЦикла; 
			КонецПопытки;
			
			Если ВыводитьВложенные И флЕстьВложенные Тогда
				ВложенныеЭлементы = ЭлементДерева.ПолучитьЭлементы();
				ВложенныеЭлементы.Добавить();
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры // ЗаполнитьДеревоПолей()

// Процедура заполняет ветку дерева типами составного поля.
// 
// Параметры:
//  ПолеНастройки - ПолеНастройки.
//  СтрокаРодитель - ДанныеФормыЭлементДерева.
//
&НаСервере
Процедура ЗаполнитьВеткуТиповПоля(ПолеНастройки, СтрокаРодитель)
	
	ТипыПоля = ПолеНастройки.ТипЗначения.Типы();
	
	ПодчиненныеСтроки = СтрокаРодитель.ПолучитьЭлементы();
	
	ШаблонСинонима = "%1 (%2)";
	
	Для каждого ТипСоставногоПоля Из ТипыПоля Цикл
		МетаданныеТипа = Метаданные.НайтиПоТипу(ТипСоставногоПоля);
		
		МассивОдиночногоТипа = Новый Массив;
		МассивОдиночногоТипа.Добавить(ТипСоставногоПоля);
		ВходящийТип          = Новый ОписаниеТипов(МассивОдиночногоТипа);
		
		СтрокаТипа = ПодчиненныеСтроки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТипа, СтрокаРодитель, "ПутьКДанным, Синоним, Представление");
		Если МетаданныеТипа = Неопределено Тогда
			СтрокаТипа.Имя     = СтрокаРодитель.Имя;
			СтрокаТипа.Синоним = СтрШаблон(ШаблонСинонима, СтрокаТипа.Синоним, "");
		Иначе	
			СтрокаТипа.Имя     = СтрокаРодитель.Имя + "." + МетаданныеТипа.Имя;
			СтрокаТипа.Синоним = СтрШаблон(ШаблонСинонима, СтрокаТипа.Синоним, МетаданныеТипа.Представление());
		КонецЕсли;
		СтрокаТипа.ТипЗначения      = ВходящийТип;
		СтрокаТипа.ЭтоВыборТипаПоля = Истина;
		
		ВложенныеЭлементы = СтрокаТипа.ПолучитьЭлементы();
		ВложенныеЭлементы.Добавить();
	КонецЦикла;
	
КонецПроцедуры

// Процедура добавляет вложенные поля в дерево полей. 
// 
// Параметры:
//  ИдСтроки - Строка.
// 
&НаСервере
Процедура ДобавитьВложенныеПоля(Знач ИдСтроки)
	
	ЭлементДерева = ДеревоПолей.НайтиПоИдентификатору(ИдСтроки);
	
	Если ЭлементДерева <> Неопределено Тогда
		
		Вложенные = ЭлементДерева.ПолучитьЭлементы();
		Вложенные.Очистить();
		
		Построитель = ИнициализироватьПостроитель();		
		Если ПостроительГодный(Построитель) Тогда
			
			МассивИмен = бит_СтрокиКлиентСервер.РазобратьСтрокуСРазделителями(ЭлементДерева.ПутьКДанным, ".");
			
			ТекКоллекция = Построитель.ДоступныеПоля;
			
			Сй = 0;
			Для каждого Имя Из МассивИмен Цикл			
				ТекПоле = ТекКоллекция.Найти(Имя);				
				Если ТекПоле <> Неопределено Тогда				
					 ТекКоллекция = ТекПоле.Поля;					 
				КонецЕсли;				
				Сй = Сй+1;	
			КонецЦикла; 
			
			Если Сй = МассивИмен.Количество() Тогда				
				ДоступноеПоле = ТекПоле;				
			Иначе				
				ДоступноеПоле = Неопределено;				
			КонецЕсли;			
			
			Если ДоступноеПоле <> Неопределено Тогда
				
				Если НЕ ЭлементДерева.ЭтоВыборТипаПоля
					И ДоступноеПоле.ТипЗначения.Типы().Количество() > 1 Тогда
					ЗаполнитьВеткуТиповПоля(ДоступноеПоле, ЭлементДерева);
				Иначе
					ЗаполнитьДеревоПолей(ДоступноеПоле.Поля, Вложенные, ЭлементДерева);
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры // ДобавитьВложенныеПоля()

// Инициализирует построитель. 
// 
&НаСервере
Функция ИнициализироватьПостроитель()
	
	Построитель = Неопределено;
	
	Если ЭтоВнешняяБаза Тогда
		
		Если НастройкаПодключения.РасположениеБазы = Перечисления.бит_мпд_ВидыРасположенияИнформационныхБаз.RestСервис Тогда
			
			// Инициализируем таблицу значений, которая будет служить в качестве источника построителя.
			 ТабВрем = Новый ТаблицаЗначений;
			 
			 Для каждого КиЗ Из ВыбранныеПоляИсточника Цикл
			 
			 	ОписаниеПоля = КиЗ.Значение;
				
				Если ОписаниеПоля.ВидПоля = "Ресурс" Тогда
					
					ТекОписание = Новый ОписаниеТипов("Число");
					
				Иначе	
					
					СтрОтбор = Новый Структура("Имя", ОписаниеПоля.Имя);
					
					НайденныеСтроки = ЗапросБД.ДоступныеПоля.НайтиСтроки(СтрОтбор);
					
					Если НайденныеСтроки.Количество() > 0 Тогда
					
						 ПерваяСтрока = НайденныеСтроки[0];
						 ТекОписание = бит_ОбщегоНазначенияКлиентСервер.ПолучитьОписаниеИзСтроки(ПерваяСтрока.ТипСтр,,Новый ОписаниеТипов("Строка"));
						 
					 Иначе
						 
						 ТекОписание = Новый ОписаниеТипов("Строка");
						 
					КонецЕсли; 
					
				КонецЕсли; 
				
				ИмяКолонки = ?(ЗначениеЗаполнено(ОписаниеПоля.Синоним), ОписаниеПоля.Синоним, ОписаниеПоля.Имя);
				ТабВрем.Колонки.Добавить(ИмяКолонки, ТекОписание);
				
			КонецЦикла; 
			 
			 Построитель = Новый ПостроительЗапроса;
			 Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабВрем);
			
		Иначе	
			
			Соединение = ВыполнитьПодключение();
			Если НЕ Соединение = Неопределено Тогда
				Построитель = Соединение.NewObject("ПостроительЗапроса");
				Попытка
					Построитель.Текст = ТекстЗапроса;
				Исключение
					ТекстСообщения = НСтр("ru = 'Ошибка выполнения: %1'; en = 'Runtime error: %1'");
					ВызватьИсключение СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке())); 
				КонецПопытки;
			КонецЕсли; 
		КонецЕсли; 
	Иначе
		
		Построитель = Новый ПостроительЗапроса;
		
		Если ЭтоАдресВременногоХранилища(АдресИсточникаПостроителя) Тогда
			ИсточникПостроителя = ПолучитьИзВременногоХранилища(АдресИсточникаПостроителя);
			Попытка
				Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ИсточникПостроителя);
			Исключение
				ТекстСообщения = НСтр("ru = 'Ошибка выполнения: %1'; en = 'Runtime error: %1'");
				ВызватьИсключение СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
		Иначе	
			Попытка
				Построитель.Текст = ТекстЗапроса;
				Если ЗначениеЗаполнено(ЗапросБД) И ЗапросБД.АвтозаполнениеНастроек Тогда
					Построитель.ЗаполнитьНастройки();
				Иначе
					НастройкиДопИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
					НастройкиОснИзмерений = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Все", "Синоним");

					Для каждого ДоступноеПоле Из Построитель.ДоступныеПоля Цикл
						ОписаниеИзмерения = НастройкиДопИзмерений.Получить(ДоступноеПоле.Имя);
						Если ОписаниеИзмерения <> Неопределено Тогда
							ДоступноеПоле.Представление = ОписаниеИзмерения.Синоним;
						Иначе
							Если НастройкиОснИзмерений.Свойство(ДоступноеПоле.Имя, ОписаниеИзмерения) Тогда
								ДоступноеПоле.Представление = ОписаниеИзмерения;
							КонецЕсли; 
						КонецЕсли; 
					КонецЦикла; 
				КонецЕсли; 
			Исключение
				ТекстСообщения = НСтр("ru = 'Ошибка в тексте запроса'; en = 'Error in request text'");
				ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка, 
					Метаданные.ОбщиеФормы.бит_мпд_ФормаВыбораСвойствПостроителя, ТекстЗапроса, 
					КраткоеПредставлениеОшибки(ИнформацияОбОшибке())); 
			КонецПопытки;
		КонецЕсли; 
	КонецЕсли; 
	
	Если СписокСубконто.Количество() > 0 Тогда
		бит_БухгалтерскиеОтчетыСервер.УстановитьТипыОтборовПостроителяПоСубконто(Построитель, СписокСубконто.ВыгрузитьЗначения(), ДтКт); 	
	КонецЕсли;
	
	Возврат Построитель;
	
КонецФункции // ИнициализироватьПостроитель()

// Функция выполняет подключение по COM.
// 
// Возвращаемое значение:
//  Соединение - ComObject.
// 
&НаСервере
Функция ВыполнитьПодключение()
	
	Соединение = Неопределено;
	
	Если ЗначениеЗаполнено(НастройкаПодключения) Тогда
		
		Соединение = бит_ПолучениеДанных.ПодключитьКОМ(НастройкаПодключения);
		
	КонецЕсли; 
	
	Возврат Соединение;
	
КонецФункции // ВыполнитьСоединение()

#КонецОбласти
